#include <iostream>

using namespace std;
int a[2000];//定义一个数组，0的为不是 ，不为0的是重复的
int main () {
	int n;
	cin >> n;
	for (int i = 0; i <= n - 1; i++) {
		cin >> a[i];
	}


	for (int i = 0; i <= n - 1; i++) {
		if (a[i] > 0) {
			for (int j = i + 1; j <= n - 1; j++) {
				if (a[i] == a[j]) {
					a[j] = -1;
				}
			}
		}
	}
	for (int i = 0; i <= n - 1; i++) {
		if (a[i] > 0)
			cout << a[i] << " ";
	}

	return 0;
}
/*【题目描述】
给定含有n个整数的序列，要求对这个序列进行去重操作。所谓去重，是指对这个序列中每个重复出现的数，只保留该数第一次出现的位置，删除其余位置。

【输入】
输入包含两行：

第一行包含一个正整数n（1≤n≤20000），表示第二行序列中数字的个数；

第二行包含n个整数，整数之间以一个空格分开。每个整数大于等于10、小于等于5000。

【输出】
输出只有一行，按照输入的顺序输出其中不重复的数字，整数之间用一个空格分开。*/